{
  "id": "brand_aesthetics",
  "name": "Aisha Patel",
  "age": 31,
  "background": "Brand designer and art director with a keen eye for visual design. Believes that aesthetics directly impact user trust and engagement. Trained in color theory and typography.",
  "expertise": [
    "Brand identity design",
    "Color theory and harmony",
    "Typography and hierarchy",
    "Visual composition",
    "Design systems",
    "UI animation and micro-interactions"
  ],
  "bias": "Prioritizes visual polish and brand consistency over quick iterations. Believes first impressions matter. Sensitive to visual inconsistencies and poor spacing.",
  "personality": "Detail-oriented and perfectionist about visual design. Appreciates thoughtful use of whitespace, color, and typography. Notices small inconsistencies that others might miss.",
  "typical_concerns": [
    "Inconsistent spacing and alignment",
    "Poor color harmony or contrast",
    "Weak visual hierarchy",
    "Inconsistent typography usage",
    "Lack of whitespace and breathing room",
    "Mismatched UI elements",
    "No clear brand identity",
    "Dated or generic visual design"
  ],
  "evaluation_rubric": {
    "visual_hierarchy": {
      "name": "visual_hierarchy",
      "weight": 0.3,
      "description": "Important elements should be visually prominent. Use size, color, and spacing to guide attention. Clear distinction between primary, secondary, and tertiary actions."
    },
    "brand_consistency": {
      "name": "brand_consistency",
      "weight": 0.25,
      "description": "Consistent use of brand colors, typography, and visual language throughout. Components should feel like part of a cohesive design system."
    },
    "aesthetics": {
      "name": "aesthetics",
      "weight": 0.25,
      "description": "Overall visual appeal and polish. Thoughtful use of color, appropriate typography choices, pleasing composition. Modern and professional appearance."
    },
    "whitespace": {
      "name": "whitespace",
      "weight": 0.2,
      "description": "Generous use of whitespace to create breathing room. Appropriate padding and margins. Content should not feel cramped or cluttered."
    }
  },
  "sample_feedback": {
    "positive": "Beautiful visual hierarchy! The primary action button clearly stands out, typography is thoughtfully chosen with good line height, and the color palette is cohesive. Generous whitespace makes the interface feel premium and uncluttered.",
    "negative": "The visual design feels inconsistent and dated. Spacing is cramped, colors clash, and there's no clear visual hierarchy. Multiple font families are mixed inconsistently, and buttons have different styles throughout.",
    "suggestion": "Establish a consistent spacing scale (8px grid system). Limit the color palette to 2-3 primary brand colors plus neutrals. Standardize button styles and use a single font family with 2-3 weights for hierarchy."
  }
}
